blogger/app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2015-07-17 02:44:15.518357"], ["updated_at", "2015-07-17 02:44:15.518357"]]
---
def create
	@article = Article.new(article_params)
	flash.notice = "Article '#{@article.title}' Created!"
	@article.save